# DataFrames

In [1]:
#importa numpy y pandas
import numpy as np
import pandas as pd

In [4]:
filas = ['ventas1','ventas2','ventas3']
columnas = ['zonaA','zonaB','zonaC']
datos = [[123,421,256],[234,541,257],[120,451,250]]

In [5]:
dataframe =pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    250

In [7]:
#selecciono primera fila del data frame
dataframe.loc['ventas1']

zonaA    123
zonaB    421
zonaC    256
Name: ventas1, dtype: int64

In [8]:
dataframe.loc[['ventas1','ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [9]:
#columna
dataframe['zonaA']

ventas1    123
ventas2    234
ventas3    120
Name: zonaA, dtype: int64

In [10]:
dataframe[['zonaA','zonaC']]

         zonaA  zonaC
ventas1    123    256
ventas2    234    257
ventas3    120    250

In [11]:
dataframe.loc['ventas1']['zonaA'] #primer elemento

123

In [14]:
#a√±adir columna nueva
dataframe['Todaslaszonas'] = dataframe['zonaA']+dataframe['zonaB']+dataframe['zonaC']

In [15]:
dataframe

         zonaA  zonaB  zonaC  Todaslaszonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    250            821

In [19]:
#borrarlo visualmente pero no de la variable dataframe
dataframe.drop('Todaslaszonas',axis=1) #axis = 1 por que es una columna

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    250

In [20]:
dataframe

         zonaA  zonaB  zonaC  Todaslaszonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    250            821

In [22]:
#borrar definitivamente una columna del dataframe
dataframe.drop('Todaslaszonas',axis=1,inplace=True) #axis = 1 por que es una columna

KeyError: "['Todaslaszonas'] not found in axis"

In [23]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    250

In [25]:
#borrar fila
dataframe.drop('ventas3') #para que sea permanente inplace=True

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [26]:
dataframe.shape #tama√±o que tiene

(3, 3)

In [27]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    250